content/notes/xmobar.org
:PROPERTIES:
:ID:       83c760ea-38fa-4bd4-ae85-c98e993237aa
:END:
#+title: Xmobar
#+date: [2022-06-25 Sat 22:13]
* Xmobar
** Errors
There is probably a better way to do this.

The error is the following
#+BEGIN_SRC sh
xmobar: SocketError {socketErrorMessage = "Network.Socket.connect: <socket: 5>: does not exist (No such file or directory)", socketErrorFatal = True, socketErrorAddress = Just (Address "unix:path=/run/user/1000/bus")}
#+END_SRC

You need to run Xmobar with dbus-launch.
#+BEGIN_SRC sh
dbus-launch xmobar
#+END_SRC
