notes/xmobar.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Xmobar</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://www.haider.gq/base/style.css'/> 
<link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css' /> 
<link rel='preconnect' href='https://fonts.googleapis.com'> 
<link rel='preconnect' href='https://fonts.gstatic.com' crossorigin> 
<link href='https://fonts.googleapis.com/css2?family=Poppins:ital@1&family=Roboto&display=swap' rel='stylesheet'>
<meta name='keywords' content='development, coding, programming, linux, emacs, guix'>
<link rel='icon' type='image/x-icon' href='/base/favicon.png'>
<meta name='description' content="Haider Mirza's website">
</head>
<body>
<div id="preamble" class="status">
<div class='grid-container'>
      <div class='grid-item header'>

	<a href='https://www.haider.gq' class='Header_Title'>
	  <span class='Header_Haider-Mirza'>Haider Mirza</span>
	</a>
	<ul class='Header_links'>
	  <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
	  <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
	  <li><a href='https://www.haider.gq/notes'>Notes</a></li>
	</ul>
	<input type='search' class='Sidebar_Search' placeholder='Search Posts...'>
	</div>

	<div class='grid-item main'>
	  <input type='search' class='Main_Search' placeholder='Search Posts...'>
	      <div class='main-main'> <!-- The actual main part -->
</div>
<div id="content" class="content">
<h1 class="title">Xmobar</h1>
<div id="outline-container-orgc71285d" class="outline-2">
<h2 id="orgc71285d">Xmobar</h2>
<div class="outline-text-2" id="text-orgc71285d">
</div>
<div id="outline-container-orgb12722a" class="outline-3">
<h3 id="orgb12722a">Errors</h3>
<div class="outline-text-3" id="text-orgb12722a">
<p>
There is probably a better way to do this.
</p>

<p>
The error is the following
</p>
<div class="org-src-container">
<pre class="src src-sh">xmobar: SocketError {socketErrorMessage = <span style="font-style: italic;">"Network.Socket.connect: &lt;socket: 5&gt;: does not exist (No such file or directory)"</span>, socketErrorFatal = True, socketErrorAddress = Just (Address <span style="font-style: italic;">"unix:path=/run/user/1000/bus"</span>)}
</pre>
</div>

<p>
You need to run Xmobar with dbus-launch.
</p>
<div class="org-src-container">
<pre class="src src-sh">dbus-launch xmobar
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org15b8482" class="outline-2">
<h2 id="org15b8482">Links to this note</h2>
</div>
</div>
<div id="postamble" class="status">
</div>
		    </div>
		<div class='grid-item sidebar'>
		  <h2>Socials</h2>
		  <ul class='sidebar-socials'>
		    <li><a href='mailto:haider@haider.gq'><i class='fa-solid fa-envelope'></i> Email</a></li>
		    <li class='irc' onclick='alert('My Username is Haider,
You can find me in Libera.Chat on these channels:
- #tropin 
- #systemcrafters 
- #guix');'><i class='fa-solid fa-message'></i> IRC/Matrix</li>
		    <li><a href='https://www.github.com/Haider-Mirza'><i class='fa-brands fa-github'></i> Github</a></li>
		  </ul>
		  <h2>Projects</h2>
		  <ul class='sidebar-projects'>
		    <li><a href='https://www.github.com/Haider-Mirza/Spinter'> Spinter</a></li>
		  </ul>
		</div>
		<div class='grid-item footer'>
		  <p>Created by Haider Mirza with orgmode in emacs</p>
		</div>
	      </div>
</div>
</body>
</html>
